# WoodSecondaryColorPower Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedWood..::..WoodSecondaryColorPower Property
AdvancedWood Class See Also
---
The property labeled "Power to compute secondary highlight color" from the "AdvancedWood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WoodSecondaryColorPower { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WoodSecondaryColorPower As String
	Get
```

Visual C++
---
```text
public:
static property String^ WoodSecondaryColorPower {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble".
# See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace